GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f45q10.inc
LC7D2S0          EQU  H'0000'
LC7D2S1          EQU  H'0001'
LC7D2S2          EQU  H'0002'
LC7D2S3          EQU  H'0003'
LC7D2S4          EQU  H'0004'
LC7D2S5          EQU  H'0005'
LC7D2S6          EQU  H'0006'
LC7D2S7          EQU  H'0007'


;----- CLC7SEL2 Bits -----------------------------------------------------
D3S0             EQU  H'0000'
D3S1             EQU  H'0001'
D3S2             EQU  H'0002'
D3S3             EQU  H'0003'
D3S4             EQU  H'0004'
D3S5             EQU  H'0005'
D3S6             EQU  H'0006'
D3S7             EQU  H'0007'

LC7D3S0          EQU  H'0000'
LC7D3S1          EQU  H'0001'
LC7D3S2          EQU  H'0002'
LC7D3S3          EQU  H'0003'
LC7D3S4          EQU  H'0004'
LC7D3S5          EQU  H'0005'
LC7D3S6          EQU  H'0006'
LC7D3S7          EQU  H'0007'


;----- CLC7SEL3 Bits -----------------------------------------------------
D4S0             EQU  H'0000'
D4S1             EQU  H'0001'
D4S2             EQU  H'0002'
D4S3             EQU  H'0003'
D4S4             EQU  H'0004'
D4S5             EQU  H'0005'
D4S6             EQU  H'0006'
D4S7             EQU  H'0007'

LC7D4S0          EQU  H'0000'
LC7D4S1          EQU  H'0001'
LC7D4S2          EQU  H'0002'
LC7D4S3          EQU  H'0003'
LC7D4S4          EQU  H'0004'
LC7D4S5          EQU  H'0005'
LC7D4S6          EQU  H'0006'
LC7D4S7          EQU  H'0007'


;----- CLC7GLS0 Bits -----------------------------------------------------
G1D1N            EQU  H'0000'
G1D1T            EQU  H'0001'
G1D2N            EQU  H'0002'
G1D2T            EQU  H'0003'
G1D3N            EQU  H'0004'
G1D3T            EQU  H'0005'
G1D4N            EQU  H'0006'
G1D4T            EQU  H'0007'

LC7G1D1N         EQU  H'0000'
LC7G1D1T         EQU  H'0001'
LC7G1D2N         EQU  H'0002'
LC7G1D2T         EQU  H'0003'
LC7G1D3N         EQU  H'0004'
LC7G1D3T         EQU  H'0005'
LC7G1D4N         EQU  H'0006'
LC7G1D4T         EQU  H'0007'


;----- CLC7GLS1 Bits -----------------------------------------------------
G2D1N            EQU  H'0000'
G2D1T            EQU  H'0001'
G2D2N            EQU  H'0002'
G2D2T            EQU  H'0003'
G2D3N            EQU  H'0004'
G2D3T            EQU  H'0005'
G2D4N            EQU  H'0006'
G2D4T            EQU  H'0007'

LC7G2D1N         EQU  H'0000'
LC7G2D1T         EQU  H'0001'
LC7G2D2N         EQU  H'0002'
LC7G2D2T         EQU  H'0003'
LC7G2D3N         EQU  H'0004'
LC7G2D3T         EQU  H'0005'
LC7G2D4N         EQU  H'0006'
LC7G2D4T         EQU  H'0007'


;----- CLC7GLS2 Bits -----------------------------------------------------
G3D1N            EQU  H'0000'
G3D1T            EQU  H'0001'
G3D2N            EQU  H'0002'
G3D2T            EQU  H'0003'
G3D3N            EQU  H'0004'
G3D3T            EQU  H'0005'
G3D4N            EQU  H'0006'
G3D4T            EQU  H'0007'

LC7G3D1N         EQU  H'0000'
LC7G3D1T         EQU  H'0001'
LC7G3D2N         EQU  H'0002'
LC7G3D2T         EQU  H'0003'
LC7G3D3N         EQU  H'0004'
LC7G3D3T         EQU  H'0005'
LC7G3D4N         EQU  H'0006'
LC7G3D4T         EQU  H'0007'


;----- CLC7GLS3 Bits -----------------------------------------------------
G4D1N            EQU  H'0000'
G4D1T            EQU  H'0001'
G4D2N            EQU  H'0002'
G4D2T            EQU  H'0003'
G4D3N            EQU  H'0004'
G4D3T            EQU  H'0005'
G4D4N            EQU  H'0006'
G4D4T            EQU  H'0007'

LC7G4D1N         EQU  H'0000'
LC7G4D1T         EQU  H'0001'
LC7G4D2N         EQU  H'0002'
LC7G4D2T         EQU  H'0003'
LC7G4D3N         EQU  H'0004'
LC7G4D3T         EQU  H'0005'
LC7G4D4N         EQU  H'0006'
LC7G4D4T         EQU  H'0007'


;----- CLC8CON Bits -----------------------------------------------------
INTN_CLC8CON     EQU  H'0003'
INTP_CLC8CON     EQU  H'0004'
OUT_CLC8CON      EQU  H'0005'
EN               EQU  H'0007'

MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'

LC8INTN          EQU  H'0003'
LC8INTP          EQU  H'0004'
LC8OUT           EQU  H'0005'
LC8EN            EQU  H'0007'

LC8MODE0         EQU  H'0000'
LC8MODE1         EQU  H'0001'
LC8MODE2         EQU  H'0002'


;----- CLC8POL Bits -----------------------------------------------------
G1POL            EQU  H'0000'
G2POL            EQU  H'0001'
G3POL            EQU  H'0002'
G4POL            EQU  H'0003'
POL_CLC8POL      EQU  H'0007'

LC8G1POL         EQU  H'0000'
LC8G2POL         EQU  H'0001'
LC8G3POL         EQU  H'0002'
LC8G4POL         EQU  H'0003'
LC8POL           EQU  H'0007'


;----- CLC8SEL0 Bits -----------------------------------------------------
D1S0             EQU  H'0000'
D1S1             EQU  H'0001'
D1S2             EQU  H'0002'
D1S3             EQU  H'0003'
D1S4             EQU  H'0004'
D1S5             EQU  H'0005'
D1S6             EQU  H'0006'
D1S7             EQU  H'0007'

LC8D1S0          EQU  H'0000'
LC8D1S1          EQU  H'0001'
LC8D1S2          EQU  H'0002'
LC8D1S3          EQU  H'0003'
LC8D1S4          EQU  H'0004'
LC8D1S5          EQU  H'0005'
LC8D1S6          EQU  H'0006'
LC8D1S7          EQU  H'0007'


;----- CLC8SEL1 Bits -----------------------------------------------------
D2S0             EQU  H'0000'
D2S1             EQU  H'0001'
D2S2             EQU  H'0002'
D2S3             EQU  H'0003'
D2S4             EQU  H'0004'
D2S5             EQU  H'0005'
D2S6             EQU  H'0006'
D2S7             EQU  H'0007'

LC8D2S0          EQU  H'0000'
LC8D2S1          EQU  H'0001'
LC8D2S2          EQU  H'0002'
LC8D2S3          EQU  H'0003'
LC8D2S4          EQU  H'0004'
LC8D2S5          EQU  H'0005'
LC8D2S6          EQU  H'0006'
LC8D2S7          EQU  H'0007'


;----- CLC8SEL2 Bits -----------------------------------------------------
D3S0             EQU  H'0000'
D3S1             EQU  H'0001'
D3S2             EQU  H'0002'
D3S3             EQU  H'0003'
D3S4             EQU  H'0004'
D3S5             EQU  H'0005'
D3S6             EQU  H'0006'
D3S7             EQU  H'0007'

LC8D3S0          EQU  H'0000'
LC8D3S1          EQU  H'0001'
LC8D3S2          EQU  H'0002'
LC8D3S3          EQU  H'0003'
LC8D3S4          EQU  H'0004'
LC8D3S5          EQU  H'0005'
LC8D3S6          EQU  H'0006'
LC8D3S7          EQU  H'0007'


;----- CLC8SEL3 Bits -----------------------------------------------------
D4S0             EQU  H'0000'
D4S1             EQU  H'0001'
D4S2             EQU  H'0002'
D4S3             EQU  H'0003'
D4S4             EQU  H'0004'
D4S5             EQU  H'0005'
D4S6             EQU  H'0006'
D4S7             EQU  H'0007'

LC8D4S0          EQU  H'0000'
LC8D4S1          EQU  H'0001'
LC8D4S2          EQU  H'0002'
LC8D4S3          EQU  H'0003'
LC8D4S4          EQU  H'0004'
LC8D4S5          EQU  H'0005'
LC8D4S6          EQU  H'0006'
LC8D4S7          EQU  H'0007'


;----- CLC8GLS0 Bits -----------------------------------------------------
G1D1N            EQU  H'0000'
G1D1T            EQU  H'0001'
G1D2N            EQU  H'0002'
G1D2T            EQU  H'0003'
G1D3N            EQU  H'0004'
G1D3T            EQU  H'0005'
G1D4N            EQU  H'0006'
G1D4T            EQU  H'0007'

LC8G1D1N         EQU  H'0000'
LC8G1D1T         EQU  H'0001'
LC8G1D2N         EQU  H'0002'
LC8G1D2T         EQU  H'0003'
LC8G1D3N         EQU  H'0004'
LC8G1D3T         EQU  H'0005'
LC8G1D4N         EQU  H'0006'
LC8G1D4T         EQU  H'0007'


;----- CLC8GLS1 Bits -----------------------------------------------------
G2D1N            EQU  H'0000'
G2D1T            EQU  H'0001'
G2D2N            EQU  H'0002'
G2D2T            EQU  H'0003'
G2D3N            EQU  H'0004'
G2D3T            EQU  H'0005'
G2D4N            EQU  H'0006'
G2D4T            EQU  H'0007'

LC8G2D1N         EQU  H'0000'
LC8G2D1T         EQU  H'0001'
LC8G2D2N         EQU  H'0002'
LC8G2D2T         EQU  H'0003'
LC8G2D3N         EQU  H'0004'
LC8G2D3T         EQU  H'0005'
LC8G2D4N         EQU  H'0006'
LC8G2D4T         EQU  H'0007'


;----- CLC8GLS2 Bits -----------------------------------------------------
G3D1N            EQU  H'0000'
G3D1T            EQU  H'0001'
G3D2N            EQU  H'0002'
G3D2T            EQU  H'0003'
G3D3N            EQU  H'0004'
G3D3T            EQU  H'0005'
G3D4N            EQU  H'0006'
G3D4T            EQU  H'0007'

