GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f45q10.inc
CWG1INPPS0       EQU  H'0000'
CWG1INPPS1       EQU  H'0001'
CWG1INPPS2       EQU  H'0002'
CWG1INPPS3       EQU  H'0003'
CWG1INPPS4       EQU  H'0004'



;----- MDCARLPPS Bits -----------------------------------------------------
MDCARLPPS0       EQU  H'0000'
MDCARLPPS1       EQU  H'0001'
MDCARLPPS2       EQU  H'0002'
MDCARLPPS3       EQU  H'0003'
MDCARLPPS4       EQU  H'0004'



;----- MDCARHPPS Bits -----------------------------------------------------
MDCARHPPS0       EQU  H'0000'
MDCARHPPS1       EQU  H'0001'
MDCARHPPS2       EQU  H'0002'
MDCARHPPS3       EQU  H'0003'
MDCARHPPS4       EQU  H'0004'



;----- MDSRCPPS Bits -----------------------------------------------------
MDSRCPPS0        EQU  H'0000'
MDSRCPPS1        EQU  H'0001'
MDSRCPPS2        EQU  H'0002'
MDSRCPPS3        EQU  H'0003'
MDSRCPPS4        EQU  H'0004'



;----- RX1PPS Bits -----------------------------------------------------
RXPPS0           EQU  H'0000'
RXPPS1           EQU  H'0001'
RXPPS2           EQU  H'0002'
RXPPS3           EQU  H'0003'
RXPPS4           EQU  H'0004'



;----- RXDT1PPS Bits -----------------------------------------------------
RXPPS0           EQU  H'0000'
RXPPS1           EQU  H'0001'
RXPPS2           EQU  H'0002'
RXPPS3           EQU  H'0003'
RXPPS4           EQU  H'0004'



;----- RXPPS Bits -----------------------------------------------------
RXPPS0           EQU  H'0000'
RXPPS1           EQU  H'0001'
RXPPS2           EQU  H'0002'
RXPPS3           EQU  H'0003'
RXPPS4           EQU  H'0004'



;----- CK1PPS Bits -----------------------------------------------------
TXPPS0           EQU  H'0000'
TXPPS1           EQU  H'0001'
TXPPS2           EQU  H'0002'
TXPPS3           EQU  H'0003'
TXPPS4           EQU  H'0004'



;----- CKPPS Bits -----------------------------------------------------
TXPPS0           EQU  H'0000'
TXPPS1           EQU  H'0001'
TXPPS2           EQU  H'0002'
TXPPS3           EQU  H'0003'
TXPPS4           EQU  H'0004'



;----- TX1PPS Bits -----------------------------------------------------
TXPPS0           EQU  H'0000'
TXPPS1           EQU  H'0001'
TXPPS2           EQU  H'0002'
TXPPS3           EQU  H'0003'
TXPPS4           EQU  H'0004'



;----- TXCK1PPS Bits -----------------------------------------------------
TXPPS0           EQU  H'0000'
TXPPS1           EQU  H'0001'
TXPPS2           EQU  H'0002'
TXPPS3           EQU  H'0003'
TXPPS4           EQU  H'0004'



;----- TXPPS Bits -----------------------------------------------------
TXPPS0           EQU  H'0000'
TXPPS1           EQU  H'0001'
TXPPS2           EQU  H'0002'
TXPPS3           EQU  H'0003'
TXPPS4           EQU  H'0004'



;----- SSP1CLKPPS Bits -----------------------------------------------------
SSPCLKPPS0       EQU  H'0000'
SSPCLKPPS1       EQU  H'0001'
SSPCLKPPS2       EQU  H'0002'
SSPCLKPPS3       EQU  H'0003'
SSPCLKPPS4       EQU  H'0004'


SSP1CLKPPS0      EQU  H'0000'
SSP1CLKPPS1      EQU  H'0001'
SSP1CLKPPS2      EQU  H'0002'
SSP1CLKPPS3      EQU  H'0003'
SSP1CLKPPS4      EQU  H'0004'



;----- SSPCLKPPS Bits -----------------------------------------------------
SSPCLKPPS0       EQU  H'0000'
SSPCLKPPS1       EQU  H'0001'
SSPCLKPPS2       EQU  H'0002'
SSPCLKPPS3       EQU  H'0003'
SSPCLKPPS4       EQU  H'0004'


SSP1CLKPPS0      EQU  H'0000'
SSP1CLKPPS1      EQU  H'0001'
SSP1CLKPPS2      EQU  H'0002'
SSP1CLKPPS3      EQU  H'0003'
SSP1CLKPPS4      EQU  H'0004'



;----- SSP1DATPPS Bits -----------------------------------------------------
SSPDATPPS0       EQU  H'0000'
SSPDATPPS1       EQU  H'0001'
SSPDATPPS2       EQU  H'0002'
SSPDATPPS3       EQU  H'0003'
SSPDATPPS4       EQU  H'0004'


SSP1DATPPS0      EQU  H'0000'
SSP1DATPPS1      EQU  H'0001'
SSP1DATPPS2      EQU  H'0002'
SSP1DATPPS3      EQU  H'0003'
SSP1DATPPS4      EQU  H'0004'



;----- SSPDATPPS Bits -----------------------------------------------------
SSPDATPPS0       EQU  H'0000'
SSPDATPPS1       EQU  H'0001'
SSPDATPPS2       EQU  H'0002'
SSPDATPPS3       EQU  H'0003'
SSPDATPPS4       EQU  H'0004'


SSP1DATPPS0      EQU  H'0000'
SSP1DATPPS1      EQU  H'0001'
SSP1DATPPS2      EQU  H'0002'
SSP1DATPPS3      EQU  H'0003'
SSP1DATPPS4      EQU  H'0004'



;----- SSP1SSPPS Bits -----------------------------------------------------
SSPSSPPS0        EQU  H'0000'
SSPSSPPS1        EQU  H'0001'
SSPSSPPS2        EQU  H'0002'
SSPSSPPS3        EQU  H'0003'
SSPSSPPS4        EQU  H'0004'


SSP1SSPPS0       EQU  H'0000'
SSP1SSPPS1       EQU  H'0001'
SSP1SSPPS2       EQU  H'0002'
SSP1SSPPS3       EQU  H'0003'
SSP1SSPPS4       EQU  H'0004'



;----- SSPSSPPS Bits -----------------------------------------------------
SSPSSPPS0        EQU  H'0000'
SSPSSPPS1        EQU  H'0001'
SSPSSPPS2        EQU  H'0002'
SSPSSPPS3        EQU  H'0003'
SSPSSPPS4        EQU  H'0004'


SSP1SSPPS0       EQU  H'0000'
SSP1SSPPS1       EQU  H'0001'
SSP1SSPPS2       EQU  H'0002'
SSP1SSPPS3       EQU  H'0003'
SSP1SSPPS4       EQU  H'0004'



;----- IPR0 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
INT1IP           EQU  H'0001'
INT2IP           EQU  H'0002'
IOCIP            EQU  H'0004'
TMR0IP           EQU  H'0005'


;----- IPR1 Bits -----------------------------------------------------
ADIP             EQU  H'0000'
ADTIP            EQU  H'0001'
CSWIP            EQU  H'0006'
OSCFIP           EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
C1IP             EQU  H'0000'
C2IP             EQU  H'0001'
ZCDIP            EQU  H'0006'
HLVDIP           EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
SSPIP            EQU  H'0000'
BCLIP            EQU  H'0001'
SSP2IP           EQU  H'0002'
BCL2IP           EQU  H'0003'
TXIP             EQU  H'0004'
RCIP             EQU  H'0005'
TX2IP            EQU  H'0006'
RC2IP            EQU  H'0007'

SSP1IP           EQU  H'0000'
BCL1IP           EQU  H'0001'
TX1IP            EQU  H'0004'
RC1IP            EQU  H'0005'


;----- IPR4 Bits -----------------------------------------------------
TMR1IP           EQU  H'0000'
TMR2IP           EQU  H'0001'
TMR3IP           EQU  H'0002'
TMR4IP           EQU  H'0003'
TMR5IP           EQU  H'0004'
TMR6IP           EQU  H'0005'


;----- IPR5 Bits -----------------------------------------------------
TMR1GIP          EQU  H'0000'
TMR3GIP          EQU  H'0001'
TMR5GIP          EQU  H'0002'
CLC1IP           EQU  H'0004'
CLC2IP           EQU  H'0005'
CLC3IP           EQU  H'0006'
CLC4IP           EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
CCP1IP           EQU  H'0000'
CCP2IP           EQU  H'0001'
CLC5IP           EQU  H'0004'
CLC6IP           EQU  H'0005'
CLC7IP           EQU  H'0006'
CLC8IP           EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
CWGIP            EQU  H'0000'
NVMIP            EQU  H'0005'
CRCIP            EQU  H'0006'
SCANIP           EQU  H'0007'

CWG1IP           EQU  H'0000'


